[
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/5/51/Facebook_f_logo_%282019%29.svg",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "Facebook is the world's largest social networking platform that allows you to connect with friends, family, and communities worldwide. Share life updates through photos, videos, and status posts, join groups based on your interests, follow pages of your favorite brands and celebrities, and discover local events happening around you. With built-in messaging features, marketplace for buying and selling items, and advanced privacy controls, Facebook serves as your digital social hub where you can stay informed, entertained, and connected with the people and topics that matter most to you.",
    "size": 174,
    "reviews": 174000000,
    "ratingAvg": 4.6,
    "downloads": 20,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 10000000 },
      { "name": "3 star", "count": 20000000 },
      { "name": "4 star", "count": 40000000 },
      { "name": "5 star", "count": 50000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "WhatsApp is a globally popular messaging application that provides secure, reliable, and intuitive communication for billions of users worldwide. Enjoy end-to-end encrypted text messaging, high-quality voice and video calls, and seamless media sharing including photos, videos, and documents. Create group chats for family, friends, or work colleagues with support for up to 256 participants. Share your real-time location, use status updates to broadcast what you're doing, and make international calls without expensive charges. With its clean interface, robust security features, and cross-platform compatibility, WhatsApp keeps you connected with your most important contacts anytime, anywhere..",
    "size": 50,
    "reviews": 100000000,
    "ratingAvg": 4.4,
    "downloads": 21,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 16000000 },
      { "name": "5 star", "count": 32000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Instagram_icon.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Instagram is a comprehensive visual storytelling platform that empowers users to capture, edit, and share photos and videos with creative tools and filters. Build your personal brand or business presence through your profile, connect with creators and communities worldwide, and discover content tailored to your interests through the intelligent Explore page. Share moments through Stories that disappear after 24 hours, go live with real-time video broadcasting, shop from your favorite brands, and watch long-form content through IGTV. With Reels for short-form entertaining videos and Direct Messaging for private conversations, Instagram offers a complete ecosystem for visual expression, community building, and digital creativity..",
    "size": 50,
    "reviews": 100000000,
    "ratingAvg": 4.5,
    "downloads": 22,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/4/42/YouTube_icon_%282013-2017%29.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 4,
    "description": "YouTube is the world's largest video platform and second-largest search engine, offering an endless library of user-generated and professional content across every conceivable category. Watch music videos, movie trailers, educational tutorials, gaming streams, news broadcasts, comedy sketches, and documentaries from creators worldwide. Subscribe to channels you love, create playlists of your favorite videos, like and comment on content that inspires you, and even upload your own videos to share with a global audience. With YouTube Premium, enjoy ad-free viewing, background play, and access to YouTube Originals. Whether you're learning new skills, staying entertained, or building a creator community, YouTube provides unparalleled video discovery and sharing experiences..",
    "size": 50,
    "reviews": 100000000,
    "ratingAvg": 4.6,
    "downloads": 23,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 12000000 },
      { "name": "4 star", "count": 24000000 },
      { "name": "5 star", "count": 48000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Logo_of_Twitter.svg",
    "title": "Twitter",
    "companyName": "Twitter, Inc.",
    "id": 5,
    "description": "Twitter is the world's real-time public conversation platform where news breaks, trends emerge, and communities gather around shared interests. Share your thoughts, opinions, and moments through 280-character tweets enhanced with photos, videos, polls, and GIFs. Follow journalists, celebrities, thought leaders, and friends to create your personalized information stream. Join global discussions using hashtags, retweet content you find valuable, like posts that resonate with you, and engage in threaded conversations that can spark meaningful connections. From live-tweeting events to customer service interactions with brands, Twitter serves as the digital public square where voices from around the world converge in real-time dialogue.",
    "size": 50,
    "reviews": 50000000,
    "ratingAvg": 4.3,
    "downloads": 24,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://img.freepik.com/premium-vector/vector-tiktok-social-media-logo_1093524-451.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 6,
    "description": "TikTok is the leading destination for short-form mobile video entertainment that has revolutionized digital content creation and consumption. Discover an endless stream of creative, authentic, and entertaining videos ranging from comedy sketches and dance challenges to cooking tutorials, life hacks, and educational content. Use powerful editing tools, special effects, filters, and an extensive music library to produce professional-quality videos in seconds. The algorithm learns your preferences to deliver a personalized 'For You' page filled with content you'll love. Join viral trends, collaborate with other creators through duets, build a following around your passions, and experience a global community where creativity knows no boundaries and anyone can become a star.",
    "size": 50,
    "reviews": 100000000,
    "ratingAvg": 4.7,
    "downloads": 25,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/KxeSAjPTKliCErbivNiXrd6cTwfbqUJcbSRPe_IBVK_YmwckfMRS1VIHz-5cgT09yMo=s64-rw",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 7,
    "description": "Snapchat redefined mobile communication with its innovative ephemeral messaging approach that prioritizes authentic, in-the-moment sharing. Send disappearing photos and videos to friends, add creative lenses and filters that transform your appearance, use augmented reality features to overlay digital elements on the real world, and share your day through Stories that compile your moments into a narrative tapestry. Discover content from major publishers and creators in the Discover section, use Snap Map to see where your friends are hanging out, and play multiplayer games with friends through integrated gaming features. With a focus on visual communication, privacy, and playful interaction, Snapchat offers a uniquely personal way to maintain relationships and express your daily experiences..",
    "size": 50,
    "reviews": 50000000,
    "ratingAvg": 4.2,
    "downloads": 26,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/82/Telegram_logo.svg",
    "title": "Telegram",
    "companyName": "Telegram Messenger LLP",
    "id": 8,
    "description": "Telegram is a cloud-based instant messaging service renowned for its emphasis on speed, security, and simplicity. Send messages, photos, videos, and files of any type without worrying about storage limits, thanks to unlimited cloud storage. Create group chats for up to 200,000 members, organize communities through broadcast channels, and make crystal-clear voice and video calls. Telegram's secret chats offer end-to-end encryption with self-destructing messages, while its open API and protocol have spawned a vibrant ecosystem of third-party clients and bots. With cross-platform synchronization, powerful message editing capabilities, and customizable themes, Telegram delivers a premium messaging experience that prioritizes both functionality and privacy for personal and professional communication needs.",
    "size": 50,
    "reviews": 50000000,
    "ratingAvg": 4.5,
    "downloads": 27,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/1/19/Spotify_logo_without_text.svg",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 9,
    "description": "Spotify revolutionized music consumption by providing instant access to millions of songs, podcasts, and audio content from artists around the globe. Discover new music through personalized recommendations, curated playlists for every mood and activity, and algorithmic radio stations that learn your taste. Create and share your own playlists, follow friends and artists to see what they're listening to, download music for offline listening, and enjoy ad-free streaming with premium subscriptions. Beyond music, Spotify offers an extensive podcast library spanning true crime, comedy, education, news, and exclusive original content. With cross-device synchronization, social features, and intelligent discovery mechanisms, Spotify delivers a complete audio ecosystem that adapts to your lifestyle and expands your auditory horizons..",
    "size": 50,
    "reviews": 100000000,
    "ratingAvg": 4.7,
    "downloads": 28,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/08/Netflix_2015_logo.svg",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 10,
    "description": "Netflix is the world's leading streaming entertainment service that transformed how we consume television shows, movies, documentaries, and original programming. Access an extensive library of content spanning multiple genres, languages, and cultures, with personalized recommendations powered by sophisticated algorithms that analyze your viewing habits. Watch award-winning Netflix Originals you can't find anywhere else, binge entire seasons without commercials, download titles to your device for offline viewing, and create multiple profiles for different household members. With support for 4K Ultra HD, HDR video quality, and immersive audio formats, Netflix delivers cinema-quality entertainment directly to your screens. From groundbreaking series to blockbuster films and thought-provoking documentaries, Netflix provides endless entertainment options tailored to your preferences.",
    "size": 50,
    "reviews": 100000000,
    "ratingAvg": 4.6,
    "downloads": 29,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/lmG9HlI0awHie0cyBieWXeNjpyXvHPwDBb8MNOVIyp0P8VEh95AiBHtUZSDVR3HLe3A=s64-rw",
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "id": 11,
    "description": "AI-powered conversational assistant for various tasks.",
    "size": 45,
    "reviews": 80000000,
    "ratingAvg": 4.8,
    "downloads": 30,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 71000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/NafAciugdQk6L7_D0cmNq8cypX0pvA88h9DzlxIJQbPd3caZM3_S5-nZedHdnrcq_wCm=s64-rw",
    "title": "CapCut",
    "companyName": "ByteDance",
    "id": 12,
    "description": "Video editing app with advanced features.",
    "size": 60,
    "reviews": 70000000,
    "ratingAvg": 4.6,
    "downloads": 31,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 54000000 }
    ]
  }
]
